Revit 2026 API

# WireCreate Method

---
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Wire Create(
	Document document,
	ElementId wireTypeId,
	ElementId viewId,
	WiringType wiringType,
	IList<XYZ> vertexPoints,
	Connector startConnectorTo,
	Connector endConnectorTo
)
```
```vb
Public Shared Function Create (
	document As Document,
	wireTypeId As ElementId,
	viewId As ElementId,
	wiringType As WiringType,
	vertexPoints As IList(Of XYZ),
	startConnectorTo As Connector,
	endConnectorTo As Connector
) As Wire
```
```cpp
public:
static Wire^ Create(
	Document^ document,
	ElementId^ wireTypeId,
	ElementId^ viewId,
	WiringType wiringType,
	IList<XYZ^>^ vertexPoints,
	Connector^ startConnectorTo,
	Connector^ endConnectorTo
)
```
```fsharp
static member Create :
        document : Document *
        wireTypeId : ElementId *
        viewId : ElementId *
        wiringType : WiringType *
        vertexPoints : IList<XYZ> *
        startConnectorTo : Connector *
        endConnectorTo : Connector -> Wire
```

#### Parameters

document Document

wireTypeId ElementId

viewId ElementId

wiringType WiringType

vertexPoints IListXYZ

startConnectorTo Connector

endConnectorTo Connector

#### Return Value

Wire

#### Reference

Wire Class

Autodesk.Revit.DB.Electrical Namespace